#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_subnet.subnet: Reading...[0m[0m
[0m[1mdata.azurerm_resource_group.resource_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_resource_group.resource_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg][0m
[0m[1mazurerm_monitor_private_link_scope.mpls: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/privateLinkScopes/dpml-dev-ampls001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001][0m
[0m[1mazurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001][0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dpml-dev-uai001][0m
[0m[1mazurerm_log_analytics_workspace.log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.OperationalInsights/workspaces/dpml-dev-log001][0m
[0m[1mazurerm_search_service.search_service[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Search/searchServices/dpml-dev-srch001][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001][0m
[0m[1mdata.azurerm_subnet.subnet: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_monitor_private_link_scoped_service.mpls_log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/privateLinkScopes/dpml-dev-ampls001/scopedResources/ampls-dpml-dev-log001][0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/components/dpml-dev-ai001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.OperationalInsights/workspaces/dpml-dev-log001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.OperationalInsights/workspaces/dpml-dev-log001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevacr001-pe][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_container_registry_acrpush: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001/providers/Microsoft.Authorization/roleAssignments/f1eebaa4-387f-b229-ee24-336438fc10c2][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_container_registry_acrpull: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001/providers/Microsoft.Authorization/roleAssignments/ab0e0888-ab0b-6466-20e8-cf88c3ad8ff7][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_container_registry_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001/providers/Microsoft.Authorization/roleAssignments/9050a203-1d4b-f20d-b940-0c2273a321b4][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_resource_group_reader: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Authorization/roleAssignments/3775fde6-f3c4-5e17-479b-cf3f28b095be][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001|logAnalytics][0m
[0m[1mazurerm_private_endpoint.search_service_private_endpoint[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-srch001-pe][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_search_service[0]: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_role_assignment_search_service_contributor[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Search/searchServices/dpml-dev-srch001/providers/Microsoft.Authorization/roleAssignments/3b3d2f92-9fb0-9029-bbf6-dcbb6a268dca][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001/providers/Microsoft.Authorization/roleAssignments/869bbb67-dec0-1553-023d-c99679a889bb][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_search_service[0]: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Search/searchServices/dpml-dev-srch001][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_administrator: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001/providers/Microsoft.Authorization/roleAssignments/04aeaeeb-190f-ce94-0012-ba1be74d5199][0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-kv001-pe][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_search_service[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Search/searchServices/dpml-dev-srch001|logAnalytics][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001|logAnalytics][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_storage_table_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/a1e24784-958e-b9a2-8efb-a99fa34dd2dd][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-queue-pe][0m
[0m[1mazurerm_cognitive_account.cognitive_account_openai[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.CognitiveServices/accounts/dpml-dev-aoai001][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_storage_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/83510c70-ab6c-3c1f-07d1-bf8f8bb880d9][0m
[0m[1mazurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/edae7e24-f1b0-b3cf-7f9f-5fef77f0e997][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-blob-pe][0m
[0m[1mazurerm_role_assignment.search_role_assignment_storage_blob_contributor[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/f5e7aa12-9047-5bc7-4d6e-6a547301ede0][0m
[0m[1mazurerm_role_assignment.search_role_assignment_storage_reader_and_data_access[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/77d5b9a7-3938-f5c5-6972-c5643a545687][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_storage_file_data_priviliged_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/45d45e6b-0b7d-9f12-018c-f6e55403207d][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_storage_blob_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/62a30f1e-405a-ce11-f44d-48260053eb6c][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_table: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-table-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_file: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-file-pe][0m
[0m[1mazurerm_storage_management_policy.storage_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/managementPolicies/default][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_application_insights_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/components/dpml-dev-ai001/providers/Microsoft.Authorization/roleAssignments/117a660f-c0ec-a0bd-836f-11b4c4e8ff7a][0m
[0m[1mazurerm_monitor_private_link_scoped_service.mpls_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/privateLinkScopes/dpml-dev-ampls001/scopedResources/ampls-dpml-dev-ai001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mazapi_update_resource.cognitive_account_update[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.CognitiveServices/accounts/dpml-dev-aoai001][0m
[0m[1mazurerm_role_assignment.cognitive_account_openai_role_assignment_storage_blob_contributor[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/e31e5567-dd02-f09e-db12-37da31893607][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/components/dpml-dev-ai001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_service[0]: Reading...[0m[0m
[0m[1mazurerm_role_assignment.cognitive_account_openai_role_assignment_search_index_data_reader[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Search/searchServices/dpml-dev-srch001/providers/Microsoft.Authorization/roleAssignments/42368f4d-cb48-c488-cd8d-54d2eda84900][0m
[0m[1mazurerm_role_assignment.cognitive_account_openai_role_assignment_search_service_contributor[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Search/searchServices/dpml-dev-srch001/providers/Microsoft.Authorization/roleAssignments/df39a1fb-a845-3224-91f3-a97353f58e25][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_cognitive_account_openai_contributor[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.CognitiveServices/accounts/dpml-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/c42b96ba-67d5-a0a8-0af5-0fbec6b5f182][0m
[0m[1mazurerm_private_endpoint.cognitive_service_private_endpoint[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-aoai001-pe][0m
[0m[1mazurerm_role_assignment.search_role_assignment_openai_contributor[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.CognitiveServices/accounts/dpml-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/b7589b83-b73f-6be7-ee2f-114ba900e246][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_service[0]: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.CognitiveServices/accounts/dpml-dev-aoai001][0m
[0m[1mazapi_resource.cognitive_service_open_ai_model_ada[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.CognitiveServices/accounts/dpml-dev-aoai001/deployments/text-embedding-ada-002][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/components/dpml-dev-ai001|logAnalytics][0m
[0m[1mazurerm_machine_learning_workspace.machine_learning_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_service[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.CognitiveServices/accounts/dpml-dev-aoai001|logAnalytics][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_machine_learning_workspace_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001/providers/Microsoft.Authorization/roleAssignments/a1447019-0c42-3a84-ad46-fe6bbca370f5][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_machine_learning_workspace: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.machine_learning_workspace_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-mlw001-pe][0m
[0m[1mazapi_update_resource.machine_learning_managed_network: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001][0m
[0m[1mazapi_resource.machine_learning_workspace_connection_openai[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001/connections/dpml-dev-aoai001][0m
[0m[1mazapi_resource.machine_learning_workspace_connection_search[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001/connections/dpml-dev-srch001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_machine_learning_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_machine_learning_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001|logAnalytics][0m
[0m[1mazurerm_machine_learning_compute_cluster.machine_learning_compute_cluster_image_build: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001/computes/imagebuilder001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # azapi_update_resource.machine_learning_managed_network[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "machine_learning_managed_network" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m managedNetwork           = {
                      [33m~[0m[0m outboundRules = {
                          [32m+[0m[0m dpml-dev-ampls001-queue        = {
                              [32m+[0m[0m category    = "UserDefined"
                              [32m+[0m[0m destination = {
                                  [32m+[0m[0m serviceResourceId = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/privateLinkScopes/dpml-dev-ampls001"
                                  [32m+[0m[0m sparkEnabled      = true
                                  [32m+[0m[0m sparkStatus       = "Active"
                                  [32m+[0m[0m subresourceTarget = "azuremonitor"
                                }
                              [32m+[0m[0m status      = "Active"
                              [32m+[0m[0m type        = "PrivateEndpoint"
                            }
                          [33m~[0m[0m dpml-dev-aoai001-account       = {
                              [33m~[0m[0m destination = {
                                  [33m~[0m[0m sparkStatus       = "Inactive" [33m->[0m[0m "Active"
                                    [90m# (3 unchanged attributes hidden)[0m[0m
                                }
                                [90m# (3 unchanged attributes hidden)[0m[0m
                            }
                          [33m~[0m[0m dpml-dev-srch001-searchService = {
                              [33m~[0m[0m destination = {
                                  [33m~[0m[0m sparkStatus       = "Inactive" [33m->[0m[0m "Active"
                                    [90m# (3 unchanged attributes hidden)[0m[0m
                                }
                                [90m# (3 unchanged attributes hidden)[0m[0m
                            }
                          [33m~[0m[0m dpmldevst001-queue             = {
                              [33m~[0m[0m destination = {
                                  [33m~[0m[0m sparkStatus       = "Inactive" [33m->[0m[0m "Active"
                                    [90m# (3 unchanged attributes hidden)[0m[0m
                                }
                                [90m# (3 unchanged attributes hidden)[0m[0m
                            }
                          [33m~[0m[0m dpmldevst001-table             = {
                              [33m~[0m[0m destination = {
                                  [33m~[0m[0m sparkStatus       = "Inactive" [33m->[0m[0m "Active"
                                    [90m# (3 unchanged attributes hidden)[0m[0m
                                }
                                [90m# (3 unchanged attributes hidden)[0m[0m
                            }
                            [90m# (39 unchanged attributes hidden)[0m[0m
                        }
                      [33m~[0m[0m status        = {
                          [33m~[0m[0m sparkReady = false [33m->[0m[0m true
                            [90m# (1 unchanged attribute hidden)[0m[0m
                        }
                        [90m# (1 unchanged attribute hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001"
        name                    = "dpml-dev-mlw001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_private_endpoint.cognitive_service_private_endpoint[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "cognitive_service_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-aoai001-pe" -> (known after apply)
        name                          = "dpml-dev-aoai001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpml-dev-aoai001-nic"
              [31m-[0m[0m name = "dpml-dev-aoai001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-aoai001-pe/privateDnsZoneGroups/dpml-dev-aoai001-arecord/privateDnsZoneConfigs/privatelink.openai.azure.com"
              [31m-[0m[0m name                = "privatelink.openai.azure.com"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.openai.azure.com"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpml-dev-cog001.privatelink.openai.azure.com"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.116",
                        ]
                      [31m-[0m[0m name         = "dpml-dev-cog001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-aoai001-pe/privateDnsZoneGroups/dpml-dev-aoai001-arecord" -> (known after apply)
            name                 = "dpml-dev-aoai001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpml-dev-aoai001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.116" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.container_registry_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevacr001-pe" -> (known after apply)
        name                          = "dpmldevacr001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpmldevacr001-nic"
              [31m-[0m[0m name = "dpmldevacr001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevacr001-pe/privateDnsZoneGroups/dpmldevacr001-arecord/privateDnsZoneConfigs/privatelink.azurecr.io"
              [31m-[0m[0m name                = "privatelink.azurecr.io"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpmldevacr001.northeurope.data.privatelink.azurecr.io"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.110",
                        ]
                      [31m-[0m[0m name         = "dpmldevacr001.northeurope.data"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpmldevacr001.privatelink.azurecr.io"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.111",
                        ]
                      [31m-[0m[0m name         = "dpmldevacr001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevacr001-pe/privateDnsZoneGroups/dpmldevacr001-arecord" -> (known after apply)
            name                 = "dpmldevacr001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpmldevacr001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.110" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.key_vault_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-kv001-pe" -> (known after apply)
        name                          = "dpml-dev-kv001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpml-dev-kv001-nic"
              [31m-[0m[0m name = "dpml-dev-kv001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-kv001-pe/privateDnsZoneGroups/dpml-dev-kv001-arecord/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              [31m-[0m[0m name                = "privatelink.vaultcore.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpml-dev-kv001.privatelink.vaultcore.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.112",
                        ]
                      [31m-[0m[0m name         = "dpml-dev-kv001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-kv001-pe/privateDnsZoneGroups/dpml-dev-kv001-arecord" -> (known after apply)
            name                 = "dpml-dev-kv001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpml-dev-kv001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.112" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.machine_learning_workspace_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "machine_learning_workspace_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-mlw001-pe" -> (known after apply)
        name                          = "dpml-dev-mlw001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpml-dev-mlw001-nic"
              [31m-[0m[0m name = "dpml-dev-mlw001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-mlw001-pe/privateDnsZoneGroups/dpml-dev-mlw001-arecord/privateDnsZoneConfigs/privatelink_api_azureml_ms"
              [31m-[0m[0m name                = "privatelink_api_azureml_ms"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "396e8a0e-65b8-4e58-8ffe-3d174c7430da.workspace.northeurope.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.113",
                        ]
                      [31m-[0m[0m name         = "396e8a0e-65b8-4e58-8ffe-3d174c7430da.workspace.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "396e8a0e-65b8-4e58-8ffe-3d174c7430da.workspace.northeurope.cert.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.113",
                        ]
                      [31m-[0m[0m name         = "396e8a0e-65b8-4e58-8ffe-3d174c7430da.workspace.northeurope.cert"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "*.396e8a0e-65b8-4e58-8ffe-3d174c7430da.inference.northeurope.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.115",
                        ]
                      [31m-[0m[0m name         = "*.396e8a0e-65b8-4e58-8ffe-3d174c7430da.inference.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-mlw001-pe/privateDnsZoneGroups/dpml-dev-mlw001-arecord/privateDnsZoneConfigs/privatelink_notebooks_azure_net"
              [31m-[0m[0m name                = "privatelink_notebooks_azure_net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "ml-dpml-dev-ml-northeurope-396e8a0e-65b8-4e58-8ffe-3d174c7430da.northeurope.privatelink.notebooks.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.114",
                        ]
                      [31m-[0m[0m name         = "ml-dpml-dev-ml-northeurope-396e8a0e-65b8-4e58-8ffe-3d174c7430da.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-mlw001-pe/privateDnsZoneGroups/dpml-dev-mlw001-arecord" -> (known after apply)
            name                 = "dpml-dev-mlw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpml-dev-mlw001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.113" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.mpls_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "mpls_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "dpml-dev-ampls001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "dpml-dev-ampls001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "myprod-dev-analytics-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "dpml-dev-ampls001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.monitor.azure.com",
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.oms.opinsights.azure.com",
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.ods.opinsights.azure.com",
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.agentsvc.azure-automation.net",
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "dpml-dev-ampls001-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/privateLinkScopes/dpml-dev-ampls001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "azuremonitor",
            ]
        }
    }

[1m  # azurerm_private_endpoint.search_service_private_endpoint[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "search_service_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-srch001-pe" -> (known after apply)
        name                          = "dpml-dev-srch001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpml-dev-srch001-nic"
              [31m-[0m[0m name = "dpml-dev-srch001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-srch001-pe/privateDnsZoneGroups/dpml-dev-srch001-arecord/privateDnsZoneConfigs/privatelink.search.windows.net"
              [31m-[0m[0m name                = "privatelink.search.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpml-dev-srch001.privatelink.search.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.126",
                        ]
                      [31m-[0m[0m name         = "dpml-dev-srch001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-srch001-pe/privateDnsZoneGroups/dpml-dev-srch001-arecord" -> (known after apply)
            name                 = "dpml-dev-srch001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpml-dev-srch001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.126" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.storage_private_endpoint_blob[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "storage_private_endpoint_blob" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-blob-pe" -> (known after apply)
        name                          = "dpmldevst001-blob-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpmldevst001-blob-nic"
              [31m-[0m[0m name = "dpmldevst001-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-blob-pe/privateDnsZoneGroups/dpmldevst001-blob-arecord/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              [31m-[0m[0m name                = "privatelink.blob.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpmldevst001.privatelink.blob.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.106",
                        ]
                      [31m-[0m[0m name         = "dpmldevst001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-blob-pe/privateDnsZoneGroups/dpmldevst001-blob-arecord" -> (known after apply)
            name                 = "dpmldevst001-blob-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpmldevst001-blob-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.106" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.storage_private_endpoint_file[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "storage_private_endpoint_file" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-file-pe" -> (known after apply)
        name                          = "dpmldevst001-file-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpmldevst001-file-nic"
              [31m-[0m[0m name = "dpmldevst001-file-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-file-pe/privateDnsZoneGroups/dpmldevst001-file-arecord/privateDnsZoneConfigs/privatelink.file.core.windows.net"
              [31m-[0m[0m name                = "privatelink.file.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpmldevst001.privatelink.file.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.109",
                        ]
                      [31m-[0m[0m name         = "dpmldevst001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-file-pe/privateDnsZoneGroups/dpmldevst001-file-arecord" -> (known after apply)
            name                 = "dpmldevst001-file-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpmldevst001-file-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.109" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.storage_private_endpoint_queue[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "storage_private_endpoint_queue" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-queue-pe" -> (known after apply)
        name                          = "dpmldevst001-queue-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpmldevst001-queue-nic"
              [31m-[0m[0m name = "dpmldevst001-queue-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-queue-pe/privateDnsZoneGroups/dpmldevst001-queue-arecord/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              [31m-[0m[0m name                = "privatelink.queue.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpmldevst001.privatelink.queue.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.108",
                        ]
                      [31m-[0m[0m name         = "dpmldevst001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-queue-pe/privateDnsZoneGroups/dpmldevst001-queue-arecord" -> (known after apply)
            name                 = "dpmldevst001-queue-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpmldevst001-queue-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.108" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.storage_private_endpoint_table[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "storage_private_endpoint_table" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-table-pe" -> (known after apply)
        name                          = "dpmldevst001-table-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/networkInterfaces/dpmldevst001-table-nic"
              [31m-[0m[0m name = "dpmldevst001-table-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-table-pe/privateDnsZoneGroups/dpmldevst001-table-arecord/privateDnsZoneConfigs/privatelink.table.core.windows.net"
              [31m-[0m[0m name                = "privatelink.table.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dpmldevst001.privatelink.table.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.80.107",
                        ]
                      [31m-[0m[0m name         = "dpmldevst001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-table-pe/privateDnsZoneGroups/dpmldevst001-table-arecord" -> (known after apply)
            name                 = "dpmldevst001-table-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dpmldevst001-table-pe"
          [33m~[0m[0m private_ip_address             = "10.0.80.107" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1mPlan:[0m 10 to add, 1 to change, 9 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with azurerm_container_registry.container_registry,
[33m│[0m [0m  on containerregistry.tf line 1, in resource "azurerm_container_registry" "container_registry":
[33m│[0m [0m   1: resource "azurerm_container_registry" "container_registry" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0m This is only used exclusively for service endpoints (which is a feature being deprecated). Users are expected to use Private Endpoints instead
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>